{
    "app.appnav.about": "About me",
    "app.appnav.work" : "Work",
    "app.appnav.skillset" : "Skillset",
    "app.appnav.learning" : "Learning",
    "app.appnav.contact" : "Contact",
    "app.appnav.settings" : "Settings",
    "app.appnav.changelanguage" : "Change language:",
    "app.appnav.lang" : "Choose an option",
    "app.appnav.languageEs" : "Spanish",
    "app.appnav.languageEn" : "English",
    "app.appnav.changemode" : "Change mode:",
    "app.appnav.darkmode": "Dark",
    "app.appnav.lightmode": "Light",
    "app.aboutme.goal": "Goals",
    "app.aboutme.goalone": " Become a proficient full-stack developer.",
    "app.aboutme.goaltwo": "Engage in team projects to learn diverse technologies and refine collaboration skills.",
    "app.aboutme.goalthree": "Continuously adapt to new web trends and tools, ensuring innovative contributions to modern web applications.",
    "app.aboutme.objectives": "Objectives",
    "app.aboutme.objectivesone": "Collaborate on projects to sharpen my full-stack development skills, making meaningful contributions within 6 months.",
    "app.aboutme.objectivestwo": "Seek mentorship, engage in code reviews, and refine coding practices to actively contribute to team projects within 1 year.",
    "app.aboutme.objectivesthree": "Embrace new technologies and practices to ensure valuable, forward-looking contributions to the company's web development efforts.",
    "app.aboutme.study": "Web Full Stack Developer, Academlo, Medellín. April 2023 - September 2023",
    "app.aboutme.spanish": "Spanish",
    "app.aboutme.languagesone": "Native speaker",
    "app.aboutme.english" : "English",
    "app.aboutme.buttonone": "Objectives and Goals",
    "app.aboutme.buttontwo": "Education",
    "app.aboutme.buttonthree": "Languages",
    "app.home.iam": "I'm",
    "app.home.basedin": "based in Colombia",
    "app.home.description" : "I'm a curious and dedicated web developer, with a strong passion for the IT industry; always seeking constant and continuous improvement of my knowledge and skills.",
    "app.home.cvsenglish" : "Download CV",
    "app.contact.title": "Get in touch",
    "app.contact.description" : "Now that you know a lot about me, I'd love to hear how I can come in and complement your business with my skills.",
    "app.contact.formname" : "Name",
    "app.contact.formemail" : "Email",
    "app.contact.formsubject" : "Subject",
    "app.contact.formmessage" : "Message",
    "app.learning.title": "These skills will be soon in my skillset",
    "app.learning.below" : "Would you like to add another skill? Click below",
    "app.skillset.languages" : "Languages",
    "app.skillset.frameworks" : "Frameworks",
    "app.skillset.source"  : "Source Control",
    "app.work.ecommercedescription" : "Collaborative development of an online store for technological products.",
    "app.work.ecommerceinfo" : "In this project, I implemented functional solutions that increased the project’s utility. Also, I actively contributed to the team by implementing key features and solving technical issues. At the same time, I used React.js to create a dynamic and appealing interface, CSS3 with BEM, methodology for consistent styling, Axios for communication with API’s, and React-bootstrap to enhance the user experience. By the back-end, I used PostgreSQL, Express, Sequelize and Postman",
    "app.work.pokedexdescription" : "Responsive website dedicated to the Pokémon universe.",
    "app.work.pokedexinfo" : "In this project, I based the development on React.js to build an interactive website and utilized react-paginate, react-router-dom, and react-bootstrap to enhance navigation and design. In addition, I implemented protected routes and structured the content modularly, leveraging react-paginate, react-router-dom, and react-bootstrap to enrich site navigation and styling. Finally, my attention to detail and time management enabled the successful completion of all project phases and timely overcoming of technical challenges.",
    "app.work.rickandmortydescription" : "Dive into the Rick and Morty's world through this responsive website.",
    "app.work.rickandmortyinfo" : "Based on a given design, I built the best approximation possible, demonstrating my abilities to follow the requiered design at once my skills to implement the needed funcionalities",
    "app.work.cruddescription" : "Development of a responsive web platform for user management.",
    "app.work.crudinfo" : "In this development, I used React.js to create a user-friendly interface, HTML5 and CSS3 for structure and styling. Also I demonstrated autonomy in making technical decisions and skills in solving challenges. In addition, I successfully implemented the interaction between CRUD methods and communication with API’s using Axios. Finally, I created the back-end using PostgreSQL, Sequelize, Express y Postman",
    "app.work.ecommerceacadescription" : "Academlo's store, which is well-organized and easy to navigate.",
    "app.work.ecommerceacainfo" : "This is the result of a teamwork's job. In this project, we just used JS, CSS3 and HTML5, proving our skills working only with vanilla's tools. Here I could demonstrate my teamwork's abilities, my time managment and my communication skills.",
    "app.work.weatherdescription" : "Search your location and discover the weather with this simple and useful web.",
    "app.work.weatherinfo" : "Useful App to know the weather conditions in your city or wherever you want to know. It has the dark and ligth modes, and I created it consuming an API",
    "app.work.title" : "Works that I've done",
    "app.work.technologies" : "Technologies",
    "app.work.viewmore" : "View more",
    "app.work.go" : "Go"
 }
