{
    "app.appnav.about": "Sobre mí",
    "app.appnav.work" : "Proyectos",
    "app.appnav.skillset" : "Habilidades",
    "app.appnav.learning" : "En curso",
    "app.appnav.contact" : "Contacto",
    "app.appnav.settings" : "Ajustes",
    "app.appnav.changelanguage" : "Cambiar idioma:",
    "app.appnav.lang" : "Elige una opción",
    "app.appnav.languageEs" : "Español",
    "app.appnav.languageEn" : "Inglés",
    "app.appnav.changemode" : "Cambiar modo:",
    "app.appnav.darkmode": "Oscuro",
    "app.appnav.lightmode": "Claro",
    "app.aboutme.goal": "Metas",
    "app.aboutme.goalone": "Convertirme en un desarrollador web senior.",
    "app.aboutme.goaltwo": "Conectar con un equipo de desarrollo que me permita aprender diversas tecnologías y que me ayude a crecer tanto en habilidades técnicas como blandas.",
    "app.aboutme.goalthree": "Adaptarme continuamente a nuevas tendencias y herramientas en el desarrollo web, para innovar y contribuir en el desarrollo de aplicaciones web modernas.",
    "app.aboutme.objectives": "Objetivos",
    "app.aboutme.objectivesone": "Colaborar en proyectos donde pueda afinar mis habilidades de desarrollador web, logrando contribuciones significativas en los primeros 6 meses de labor.",
    "app.aboutme.objectivestwo": "Buscar mentoría, involucrarme en revisiones de código y refinar mis prácticas de programación, en procura de lograr contribuciones significativas en el equipo de desarrollo en el primer año de labor.",
    "app.aboutme.objectivesthree": "Abrazar nuevas tecnologías y prácticas de programación que ayuden a alcanzar los objetivos y metas del equipo de desarrollo.",
    "app.aboutme.study": "Web Full Stack Developer, Academlo, Medellín. Abril 2023 - Septiembre 2023",
    "app.aboutme.spanish": "Español",
    "app.aboutme.languagesone": "Hablante nativo",
    "app.aboutme.english" : "Inglés",
    "app.aboutme.buttonone": "Objetivos y metas",
    "app.aboutme.buttontwo": "Educación",
    "app.aboutme.buttonthree": "Idiomas",
    "app.home.iam": "Soy",
    "app.home.basedin": "residente en Colombia",
    "app.home.description" : "Soy un curioso y dedicado desarrollar web con una fuerte pasión por la industria IT, siempre en procura constante y continua de mejorar mis habilidades y conocimientos.",
    "app.home.cvspanish" : "Descargar CV",
    "app.contact.title": "Contáctame",
    "app.contact.description" : "Ahora que ya conoces sobre mí, me encantaría escuchar cómo puedo complementar tu negocio con mis habilidades.",
    "app.contact.formname" : "Nombre",
    "app.contact.formemail" : "Correo",
    "app.contact.formsubject" : "Asunto",
    "app.contact.formmessage" : "Mensaje",
    "app.learning.title": "Estas habilidades estarán pronto en mi caja de herramientas",
    "app.learning.below" : "¿Te gustaría agregar otra habilidad? Cliquea abajo",
    "app.skillset.languages" : "Lenguajes",
    "app.skillset.frameworks" : "Librerías",
    "app.skillset.source"  : "Herramientas de control",
    "app.work.ecommercedescription" : "Desarrollo colaborativo de una tienda online de productos tecnológicos",
    "app.work.ecommerceinfo" : "En este proyecto, implementé soluciones funcionales que incrementaron la utilidad de la página. Asimismo, utilicé React.js para crear una interfaz atractiva y dinámica, CSS3 y su metodología BEM para un estilo consistente y escalable, Axios para comunicar con API's y react-bootstrap para mejorar la experiencia de usuario. Por el lado del backend, utilicé PostgreSQL, Sequelize, Express y Postman, a la vez que usé Jest para testear los endpoints.",
    "app.work.pokedexdescription" : "Página responsiva dedicada al universo Pokémon.",
    "app.work.pokedexinfo" : "En este proyecto, basé el desarrollo en React.js para construir un sitio web interactivo y utilicé react-paginate, react-router-dom y react-bootstrap para mejorar la navegación y el diseño. Además, implementé rutas protegidas y organicé el contenido de manera modular. Finalmente, mi atención al detalle y la gestión del tiempo permitieron la finalización exitosa de todas las fases del proyecto y la superación oportuna de los desafíos técnicos.",
    "app.work.rickandmortydescription" : "Sumérgete en el mundo de Rick and Morty con esta página responsiva.",
    "app.work.rickandmortyinfo" : "Basándome en un diseño proporcionado, construí la mejor aproximación posible, demostrando mis habilidades para seguir el diseño requerido, a la vez que implementé las funcionalidades necesarias.",
    "app.work.cruddescription" : "Desarrollo de una página responsiva para la administración de usuarios",
    "app.work.crudinfo" : "En este desarrollo, utilicé React.js para crear una interfaz amigable para el usuario, HTML5 y CSS3 para la estructura y el estilo. Además, demostré autonomía en la toma de decisiones técnicas y habilidades en la resolución de desafíos. Además, implementé con éxito la interacción entre los métodos CRUD y la comunicación con API utilizando Axios, asegurando un flujo eficiente de datos dentro de la plataforma. Finalmente, creé el backend utilizando PostgreSQL, Express, Sequelize y Postman.",
    "app.work.ecommerceacadescription" : "Tienda de Academlo, bien organizada y fácil de navegar",
    "app.work.ecommerceacainfo" : "Este es el resultado de un trabajo en equipo. En este proyecto, solo utilizamos JS, CSS3 y HTML5. Aquí pude demostrar mis habilidades para el trabajo en equipo, la gestión del tiempo y mis destrezas comunicativas.",
    "app.work.weatherdescription" : "Introduce tu ubicación y descubre el clima en tu ciudad con esta simple y útil página web.",
    "app.work.weatherinfo" : "Aplicación útil para conocer las condiciones climáticas en tu ciudad o de cualquier lugar. Tiene modos oscuro y claro. La creé consumiendo una API.",
    "app.work.title" : "Proyectos que he realizado",
    "app.work.technologies" : "Tecnologías",
    "app.work.viewmore" : "Ver más",
    "app.work.go" : "Ver"
}

